pmo-dataset/variations/graphviz_basic/07.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Send ticket via email" -> "ExclusiveGateway_8";
  "Provide personal information" -> "ParallelGateway_3";
  "Customer completes journey" -> "ExclusiveGateway_5";
  "ParallelGateway_2" -> "Select date and time";
  "ExclusiveGateway_6" -> "ExclusiveGateway_9";
  "ExclusiveGateway_12" -> "ParallelGateway_4";
  "ExclusiveGateway_8" -> "ParallelGateway_1";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2";
  "ExclusiveGateway_3" -> "end";
  "ParallelGateway_1" -> "ExclusiveGateway_11";
  "ExclusiveGateway_11" -> "ExclusiveGateway_4";
  "ExclusiveGateway_5" -> "ExclusiveGateway_3";
  "ExclusiveGateway_10" -> "ExclusiveGateway_12";
  "Select date and time" -> "ParallelGateway_5";
  "Update seat inventory" -> "ParallelGateway_1";
  "Send instructions" -> "ExclusiveGateway_6";
  "Send reminder" -> "ExclusiveGateway_10";
  "ExclusiveGateway_9" -> "Send instructions";
  "ExclusiveGateway_2" -> "ParallelGateway_4";
  "ParallelGateway_2" -> "Select route";
  "ParallelGateway_6" -> "Update seat inventory";
  "ParallelGateway_4" -> "Customer completes journey";
  "ExclusiveGateway_11" -> "ExclusiveGateway_12";
  "ExclusiveGateway_4" -> "Send reminder";
  "ParallelGateway_3" -> "Generate ticket";
  "ExclusiveGateway_7" -> "Send ticket via SMS";
  "ParallelGateway_6" -> "ExclusiveGateway_7";
  "ExclusiveGateway_10" -> "ExclusiveGateway_4";
  "Generate ticket" -> "ParallelGateway_6";
  "Provide payment details" -> "ParallelGateway_3";
  "ExclusiveGateway_1" -> "ExclusiveGateway_9";
  "ExclusiveGateway_5" -> "Post-travel feedback or services";
  "start" -> "Customer searches for ticket";
  "ParallelGateway_5" -> "Provide personal information";
  "Customer searches for ticket" -> "ParallelGateway_2";
  "ParallelGateway_5" -> "Provide payment details";
  "Post-travel feedback or services" -> "ExclusiveGateway_3";
  "ParallelGateway_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_7" -> "Send ticket via email";
  "ExclusiveGateway_6" -> "ExclusiveGateway_2";
  "Select route" -> "ParallelGateway_5";
  "Send ticket via SMS" -> "ExclusiveGateway_8";

  "start" [shape=circle, label="start"];
  "end" [shape=circle, label="end"];
  "ExclusiveGateway_1" [shape=diamond, label="X"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="X"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="X"];
  "ExclusiveGateway_10" [shape=diamond, label="X"];
  "ExclusiveGateway_11" [shape=diamond, label="X"];
  "ExclusiveGateway_12" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
  "ParallelGateway_5" [shape=diamond, label="+"];
  "ParallelGateway_6" [shape=diamond, label="+"];
}
