pmo-dataset/variations/mermaid_with_ids/07.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Select route"]
	Task_2["Send ticket via\nemail"]
	Task_3["Post-travel feedback\nor services"]
	Task_4["Customer completes\njourney"]
	Task_5["Provide payment\ndetails"]
	Task_6["Send reminder"]
	Task_7["Select date and time"]
	Task_8["Provide personal\ninformation"]
	Task_9["Generate ticket"]
	Task_10["Update seat\ninventory"]
	Task_11["Send instructions"]
	Task_12["Customer searches\nfor ticket"]
	Task_13["Send ticket via SMS"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"X"}
	ExclusiveGateway_4{"X"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ExclusiveGateway_7{"X"}
	ExclusiveGateway_8{"X"}
	ExclusiveGateway_9{"X"}
	ExclusiveGateway_10{"X"}
	ExclusiveGateway_11{"X"}
	ExclusiveGateway_12{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}
	ParallelGateway_5{"+"}
	ParallelGateway_6{"+"}

	Task_2 --> ExclusiveGateway_8
	Task_8 --> ParallelGateway_3
	Task_4 --> ExclusiveGateway_5
	ParallelGateway_2 --> Task_7
	ExclusiveGateway_6 --> ExclusiveGateway_9
	ExclusiveGateway_12 --> ParallelGateway_4
	ExclusiveGateway_8 --> ParallelGateway_1
	ExclusiveGateway_1 --> ExclusiveGateway_2
	ExclusiveGateway_3 --> EndNoneEvent_1
	ParallelGateway_1 --> ExclusiveGateway_11
	ExclusiveGateway_11 --> ExclusiveGateway_4
	ExclusiveGateway_5 --> ExclusiveGateway_3
	ExclusiveGateway_10 --> ExclusiveGateway_12
	Task_7 --> ParallelGateway_5
	Task_10 --> ParallelGateway_1
	Task_11 --> ExclusiveGateway_6
	Task_6 --> ExclusiveGateway_10
	ExclusiveGateway_9 --> Task_11
	ExclusiveGateway_2 --> ParallelGateway_4
	ParallelGateway_2 --> Task_1
	ParallelGateway_6 --> Task_10
	ParallelGateway_4 --> Task_4
	ExclusiveGateway_11 --> ExclusiveGateway_12
	ExclusiveGateway_4 --> Task_6
	ParallelGateway_3 --> Task_9
	ExclusiveGateway_7 --> Task_13
	ParallelGateway_6 --> ExclusiveGateway_7
	ExclusiveGateway_10 --> ExclusiveGateway_4
	Task_9 --> ParallelGateway_6
	Task_5 --> ParallelGateway_3
	ExclusiveGateway_1 --> ExclusiveGateway_9
	ExclusiveGateway_5 --> Task_3
	StartNoneEvent_1 --> Task_12
	ParallelGateway_5 --> Task_8
	Task_12 --> ParallelGateway_2
	ParallelGateway_5 --> Task_5
	Task_3 --> ExclusiveGateway_3
	ParallelGateway_1 --> ExclusiveGateway_1
	ExclusiveGateway_7 --> Task_2
	ExclusiveGateway_6 --> ExclusiveGateway_2
	Task_1 --> ParallelGateway_5
	Task_13 --> ExclusiveGateway_8
